# Network_NotEnoughNodes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..Network_NotEnoughNodes Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The calculation could not be executed as configured. Specify at least 4 elements before analyzing this network.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId Network_NotEnoughNodes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Network_NotEnoughNodes As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ Network_NotEnoughNodes {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace